{"SLAM": {"2401.01887": {"paper_title": "LEAP-VO: Long-term Effective Any Point Tracking for Visual Odometry", "paper_abstract": "Visual odometry estimates the motion of a moving camera based on visual input. Existing methods, mostly focusing on two-view point tracking, often ignore the rich temporal context in the image sequence, thereby overlooking the global motion patterns and providing no assessment of the full trajectory reliability. These shortcomings hinder performance in scenarios with occlusion, dynamic objects, and low-texture areas. To address these challenges, we present the Long-term Effective Any Point Tracking (LEAP) module. LEAP innovatively combines visual, inter-track, and temporal cues with mindfully selected anchors for dynamic track estimation. Moreover, LEAP's temporal probabilistic formulation integrates distribution updates into a learnable iterative refinement module to reason about point-wise uncertainty. Based on these traits, we develop LEAP-VO, a robust visual odometry system adept at handling occlusions and dynamic scenes. Our mindful integration showcases a novel practice by employing long-term point tracking as the front-end. Extensive experiments demonstrate that the proposed pipeline significantly outperforms existing baselines across various visual odometry benchmarks.", "paper_authors": "Weirong Chen, Le Chen, Rui Wang, Marc Pollefeys", "update_time": "2024-01-03", "comments": "15 pages, 11 figures", "paper_url": "http://arxiv.org/abs/2401.01887", "paper_id": "2401.01887", "code_url": null}}, "Visual Localization": {"2401.01545": {"paper_title": "DDN-SLAM: Real-time Dense Dynamic Neural Implicit SLAM with Joint Semantic Encoding", "paper_abstract": "We propose DDN-SLAM, a real-time dense neural implicit semantic SLAM system designed for dynamic scenes. While existing neural implicit SLAM systems perform well in static scenes, they often encounter challenges in real-world environments with dynamic interferences, leading to ineffective tracking and mapping. DDN-SLAM utilizes the priors provided by the deep semantic system, combined with conditional probability fields, for segmentation.By constructing depth-guided static masks and employing joint multi-resolution hashing encoding, we ensure fast hole filling and high-quality mapping while mitigating the effects of dynamic information interference. To enhance tracking robustness, we utilize sparse feature points validated with optical flow and keyframes, enabling loop closure detection and global bundle optimization. Furthermore, DDN-SLAM supports monocular, stereo, and RGB-D inputs, operating robustly at a frequency of 20-30Hz. Extensive experiments on 6 virtual/real datasets demonstrate that our method outperforms state-of-the-art approaches in both dynamic and static scenes.", "paper_authors": "Mingrui Li, Jiaming He, Guangan Jiang, Hongyu Wang", "update_time": "2024-01-03", "comments": "11pages, 4figures", "paper_url": "http://arxiv.org/abs/2401.01545", "paper_id": "2401.01545", "code_url": null}}, "Image Matching": {"2401.01720": {"paper_title": "Local Adaptive Clustering Based Image Matching for Automatic Visual Identification", "paper_abstract": "Monitoring cameras are extensively utilized in industrial production to monitor equipment running. With advancements in computer vision, device recognition using image features is viable. This paper presents a vision-assisted identification system that implements real-time automatic equipment labeling through image matching in surveillance videos. The system deploys the ORB algorithm to extract image features and the GMS algorithm to remove incorrect matching points. According to the principles of clustering and template locality, a method known as Local Adaptive Clustering (LAC) has been established to enhance label positioning. This method segments matching templates using the cluster center, which improves the efficiency and stability of labels. The experimental results demonstrate that LAC effectively curtails the label drift.", "paper_authors": "Zhizhen Wang", "update_time": "2024-01-03", "comments": null, "paper_url": "http://arxiv.org/abs/2401.01720", "paper_id": "2401.01720", "code_url": null}, "2401.01574": {"paper_title": "A Transformer-Based Adaptive Semantic Aggregation Method for UAV Visual Geo-Localization", "paper_abstract": "This paper addresses the task of Unmanned Aerial Vehicles (UAV) visual geo-localization, which aims to match images of the same geographic target taken by different platforms, i.e., UAVs and satellites. In general, the key to achieving accurate UAV-satellite image matching lies in extracting visual features that are robust against viewpoint changes, scale variations, and rotations. Current works have shown that part matching is crucial for UAV visual geo-localization since part-level representations can capture image details and help to understand the semantic information of scenes. However, the importance of preserving semantic characteristics in part-level representations is not well discussed. In this paper, we introduce a transformer-based adaptive semantic aggregation method that regards parts as the most representative semantics in an image. Correlations of image patches to different parts are learned in terms of the transformer's feature map. Then our method decomposes part-level features into an adaptive sum of all patch features. By doing this, the learned parts are encouraged to focus on patches with typical semantics. Extensive experiments on the University-1652 dataset have shown the superiority of our method over the current works.", "paper_authors": "Shishen Li, Cuiwei Liu, Huaijun Qiu, Zhaokui Li", "update_time": "2024-01-03", "comments": "12 pages", "paper_url": "http://arxiv.org/abs/2401.01574", "paper_id": "2401.01574", "code_url": null}}, "NeRF": {"2401.01647": {"paper_title": "SIGNeRF: Scene Integrated Generation for Neural Radiance Fields", "paper_abstract": "Advances in image diffusion models have recently led to notable improvements in the generation of high-quality images. In combination with Neural Radiance Fields (NeRFs), they enabled new opportunities in 3D generation. However, most generative 3D approaches are object-centric and applying them to editing existing photorealistic scenes is not trivial. We propose SIGNeRF, a novel approach for fast and controllable NeRF scene editing and scene-integrated object generation. A new generative update strategy ensures 3D consistency across the edited images, without requiring iterative optimization. We find that depth-conditioned diffusion models inherently possess the capability to generate 3D consistent views by requesting a grid of images instead of single views. Based on these insights, we introduce a multi-view reference sheet of modified images. Our method updates an image collection consistently based on the reference sheet and refines the original NeRF with the newly generated image set in one go. By exploiting the depth conditioning mechanism of the image diffusion model, we gain fine control over the spatial location of the edit and enforce shape guidance by a selected region or an external mesh.", "paper_authors": "Jan-Niklas Dihlmann, Andreas Engelhardt, Hendrik Lensch", "update_time": "2024-01-03", "comments": "Project Page: https://signerf.jdihlmann.com", "paper_url": "http://arxiv.org/abs/2401.01647", "paper_id": "2401.01647", "code_url": null}}}