{"NeRF": {"2401.12568": {"paper_title": "NeRF-AD: Neural Radiance Field with Attention-based Disentanglement for Talking Face Synthesis", "paper_abstract": "Talking face synthesis driven by audio is one of the current research hotspots in the fields of multidimensional signal processing and multimedia. Neural Radiance Field (NeRF) has recently been brought to this research field in order to enhance the realism and 3D effect of the generated faces. However, most existing NeRF-based methods either burden NeRF with complex learning tasks while lacking methods for supervised multimodal feature fusion, or cannot precisely map audio to the facial region related to speech movements. These reasons ultimately result in existing methods generating inaccurate lip shapes. This paper moves a portion of NeRF learning tasks ahead and proposes a talking face synthesis method via NeRF with attention-based disentanglement (NeRF-AD). In particular, an Attention-based Disentanglement module is introduced to disentangle the face into Audio-face and Identity-face using speech-related facial action unit (AU) information. To precisely regulate how audio affects the talking face, we only fuse the Audio-face with audio feature. In addition, AU information is also utilized to supervise the fusion of these two modalities. Extensive qualitative and quantitative experiments demonstrate that our NeRF-AD outperforms state-of-the-art methods in generating realistic talking face videos, including image quality and lip synchronization. To view video results, please refer to https://xiaoxingliu02.github.io/NeRF-AD.", "paper_authors": "Chongke Bi, Xiaoxing Liu, Zhilei Liu", "update_time": "2024-01-23", "comments": "Accepted by ICASSP 2024", "paper_url": "http://arxiv.org/abs/2401.12568", "paper_id": "2401.12568", "code_url": null}, "2401.12456": {"paper_title": "Exploration and Improvement of Nerf-based 3D Scene Editing Techniques", "paper_abstract": "NeRF's high-quality scene synthesis capability was quickly accepted by scholars in the years after it was proposed, and significant progress has been made in 3D scene representation and synthesis. However, the high computational cost limits intuitive and efficient editing of scenes, making NeRF's development in the scene editing field facing many challenges. This paper reviews the preliminary explorations of scholars on NeRF in the scene or object editing field in recent years, mainly changing the shape and texture of scenes or objects in new synthesized scenes; through the combination of residual models such as GaN and Transformer with NeRF, the generalization ability of NeRF scene editing has been further expanded, including realizing real-time new perspective editing feedback, multimodal editing of text synthesized 3D scenes, 4D synthesis performance, and in-depth exploration in light and shadow editing, initially achieving optimization of indirect touch editing and detail representation in complex scenes. Currently, most NeRF editing methods focus on the touch points and materials of indirect points, but when dealing with more complex or larger 3D scenes, it is difficult to balance accuracy, breadth, efficiency, and quality. Overcoming these challenges may become the direction of future NeRF 3D scene editing technology.", "paper_authors": "Shun Fang, Ming Cui, Xing Feng, Yanan Zhang", "update_time": "2024-01-23", "comments": null, "paper_url": "http://arxiv.org/abs/2401.12456", "paper_id": "2401.12456", "code_url": null}, "2401.12451": {"paper_title": "Methods and strategies for improving the novel view synthesis quality of neural radiation field", "paper_abstract": "Neural Radiation Field (NeRF) technology can learn a 3D implicit model of a scene from 2D images and synthesize realistic novel view images. This technology has received widespread attention from the industry and has good application prospects. In response to the problem that the rendering quality of NeRF images needs to be improved, many researchers have proposed various methods to improve the rendering quality in the past three years. The latest relevant papers are classified and reviewed, the technical principles behind quality improvement are analyzed, and the future evolution direction of quality improvement methods is discussed. This study can help researchers quickly understand the current state and evolutionary context of technology in this field, which is helpful in inspiring the development of more efficient algorithms and promoting the application of NeRF technology in related fields.", "paper_authors": "Shun Fang, Ming Cui, Xing Feng, Yanna Lv", "update_time": "2024-01-23", "comments": null, "paper_url": "http://arxiv.org/abs/2401.12451", "paper_id": "2401.12451", "code_url": null}}}